Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: སྒྱུ་མའི་རྩ་བ་རབ་ཏུ་ཤེས་པས་གལ་ཏེ་མཐོང་ངམ་ཐོས་པར་གྱུར་ན་ཡང་འདི་སྙམ་དུ་བདག་གིས་ཇི་ལྟར་མཐོང་བའི་གླང་པོ་ཆེ་དང་། རྟ་ལ་སོགས་པའི་ཚོགས་གང་ཡིན་པ་དེ་དག་ནི་ཡོད་པ་མ་ཡིན་གྱི་སྒྱུ་མའི་དངོས་པོ་མིག་སླུ་བར་བྱེད་པ་ཙམ་ཞིག་ཡོད་པར་ཟད་དེ།
en: They know what the source of illusions is, so that when they see and hear them, they think, ‘The elephants, horses, and so on that I see do not exist, but they are an optical illusion from magic.’

source: མི་བདེན་པས་གླང་པོ་ཆེ་ལ་སོགས་པ་དང་བང་མཛོད་རྣམས་ཡོད་དོ་སྙམ་དུ་མི་སེམས་པས་མིང་ཙམ་ཞིག་ཡོད་པར་ཟད་ཀྱི་ཡང་དག་པར་ནི་ཅི་ཡང་མེད་དོ་སྙམ་དུ་སེམས་པས་བདག་ཉིད་ཀྱིས་ཇི་ལྟར་མཐོང་ཞིང་ཐོས་པ་དེ་དག་ལ་ཡང་ཡང་དག་པ་ཉིད་དུ་འཛིན་པར་ཡང་མི་བྱེད་ལ།
en: As they think that they are not real, they do not think that the elephants and so on and the treasuries exist. They think, ‘These are nothing but names without any reality whatsoever.’

source: ཕྱིས་དཔྱོད་ཅིང་སེམས་པའི་ཚེ་ཡང་ཡང་དག་པ་མ་ཡིན་པར་རབ་ཏུ་ཤེས་པར་འགྱུར་རོ།
en: Therefore, whatever they see or hear, they do not believe that they are real, and subsequently, when they analyze and contemplate them, they know perfectly that they are not real. “

source: །དེ་བཞིན་དུ་བློ་དང་ལྡན་པ་དག་གིས་ཀྱང་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པའི་ངོ་བོ་ཉིད་མེད་པར་རྟོགས་པས་ཀུན་རྫོབ་ཀྱི་རྗེས་སུ་ཇི་ལྟར་མཐོང་བ་དང་།
en: In that same way, the wise realize that all phenomena have no real essence.

source: ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་དངོས་པོ་སྟོན་ཅིང་རྗོད་པར་བྱེད་ཀྱི་བདེན་པའི་ཚུལ་ཡིད་ལ་བྱེད་པའི་ཚེ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ། བཏགས་པ་ཙམ་དུ་ཡང་དག་པའི་དོན་རབ་ཏུ་སྟོན་པར་བྱེད་པའི་ཕྱིར་རོ།
en: In terms of the relative, when in their minds they pay attention to the truthfulness of the things that manifest and are described according to whatever they see and whatever they hear, they know that they are not like that, because they reveal correct meanings that are just designations. “

source: །ཚངས་པའི་རྒྱལ་པོ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འཇིག་རྟེན་ལས་འདས་པའི་འཕགས་པའི་ཤེས་རབ་ཀྱི་མིག་མ་ཐོབ་པ་དག་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པ་མི་ཤེས་པའི་ཕྱིར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་འདུ་བྱེད་དང་འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་མཐོང་ངམ་ཐོས་པར་གྱུར་ན་འདི་ལྟར་ཡང་དག་པར་ཡོད་པ་ཡིན་ནོ་སྙམ་དུ་བསམས་ནས་མངོན་པར་ཞེན་པ་བསྐྱེད་ནས་དོན་དམ་པར་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པ་ཡིན་པར་མི་ཤེས་སོ། །འཕགས་པའི་གང་ཟག་གང་ཡིན་པ་དེ་དག་ནི་འདུ་བྱེད་དང་།
en: Brahmarāja, childlike, ordinary beings who have not attained the world-transcending wisdom eyes of the āryas do not know the inexpressible nature of phenomena. Therefore, when they see or hear composite or noncomposite phenomena, they think, ‘This is how it truly is,’ and develop attachment; they do not know that ultimately the nature of phenomena is inexpressible. “

source: འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་མཐོང་ངམ་ཐོས་པར་གྱུར་ན་ཅི་ནུས་ཅི་ལྕོགས་ཀྱིས་ཡང་དག་པར་ཡོད་པ་ཡིན་ནོ་སྙམ་དུ་མངོན་པར་ཞེན་པ་སྐྱེད་པར་མི་བྱེད་པས་ཐམས་ཅད་དུ་ཡང་དག་པའི་འདུ་བྱེད་ཀྱི་ཆོས་དང་ཡང་དག་པའི་འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་མེད་ཀྱི་མི་བདེན་པས་བསམས་པའི་འདུ་བྱེད་དང་།
en: When ārya individuals see or hear composite or noncomposite phenomena, to the extent of their power and ability they do not develop attachment, thinking, ‘These are real.’

source: འདུ་བྱེད་མ་ཡིན་པའི་མཚན་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་མིང་ཙམ་ཞིག་ཡོད་པས་ཡང་དག་པའི་ངོ་བོ་ཉིད་ཅི་ཡང་མེད་དོ་སྙམ་དུ་རིག་ཅིང་ཁོང་དུ་ཆུད་པར་གྱུར་ཀྱང་འཕགས་པའི་གང་ཟག་དེ་དག་ཀུན་རྫོབ་ཀྱི་རྗེས་སུ་གཞན་དག་ཡང་དག་པའི་དོན་རྟོགས་པར་བྱ་བར་འདོད་པའི་ཕྱིར་ཡང་དག་པར་སྟོན་པར་བྱེད་པ་ཡིན་ནོ།
en: Therefore, they think, ‘In everything there are no real composite phenomena or real noncomposite phenomena, and as they are not real, whatever composite or noncomposite characteristics I think of are just names and have no real essence whatsoever.’ “Those ārya individuals know and comprehend that, but because they wish others to understand the true meaning, they correctly teach it in relative terms. “

source: །དེ་བཞིན་དུ་ཚངས་པའི་རྒྱལ་པོ་འཕགས་པའི་གང་ཟག་དེ་དག་ཀྱང་འཕགས་པའི་ཤེས་པ་དང་མཐོང་བས་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པར་རྟོགས་པར་གྱུར་ཀྱང་འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་འདི་ལྟར་གཞན་དག་རྟོགས་པར་བྱ་བའི་ཕྱིར་ཀུན་རྫོབ་ཀྱི་མིང་དང་ཐ་སྙད་རྣམ་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད་པ་ཡིན་ནོ།
en: In the same way, Brahmarāja, those ārya individuals, although they have realized, through their superior knowledge and vision, the inexpressible true nature of phenomena, they teach various relative names and terms in order for others to understand composite and noncomposite phenomena in that way.”

source: །དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སེམས་ཅན་ཇི་སྙེད་ཅིག་གིས་ཡང་དག་པའི་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་ཁོང་དུ་ཆུད་པར་འགྱུར།
en: Then Brahmarāja asked the bodhisattva Cittaratnārcī, “How many beings will understand this profound true Dharma?” “

source: སྨྲས་པ། ཀྱེ་ཚངས་པའི་རྒྱལ་པོ་སྒྱུ་མའི་སྐྱེས་བུ་མང་པོའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་ཀྱིས་ཡང་དག་པའི་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: O Brahmarāja,” replied Cittaratnārcī, “the phenomena of the minds and mental events of many illusory beings will understand this kind of true, profound Dharma.”

source: །ཚངས་པའི་རྒྱལ་པོས་སྨྲས་པ། སྒྱུ་མས་སྤྲུལ་པའི་སྐྱེས་བུ་གང་ཡིན་པ་དེ་དག་ནི་ངོ་བོ་ཉིད་ཀྱིས་ཡོད་པ་མ་ཡིན་ན།
en: Brahmarāja said, “People who are illusory manifestations are nonexistent by nature.

source: འདི་དག་གི་སེམས་དང་སེམས་ལས་བྱུང་བ་གང་ལས་སྐྱེས་པར་འགྱུར།
en: From where do their minds and mental events arise?” “

source: སྨྲས་པ། གང་གིས་ཆོས་ཀྱི་དབྱིངས་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་པར་ཤེས་པའི་སེམས་ཅན་དེ་དག་གིས་དོན་ཟབ་མོ་འདི་ཤེས་པར་འགྱུར་རོ།
en: The beings who know that the Dharma realm is not existent and is not nonexistent will know this profound meaning,” replied Cittaratnārcī.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚངས་པའི་རྒྱལ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོ་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པས་དོན་ཟབ་མོ་འདི་ལྟ་བུ་མངོན་པར་རྟོགས་པར་འགྱུར་ལགས་སོ།
en: Then Brahmarāja said to the Bhagavat, “Bhagavat, this bodhisattva Cittaratnārcī has inconceivably realized this profound meaning.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: It is like that. It is like that,” replied the Bhagavat. “

source: ཚངས་པའི་རྒྱལ་པོ་ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོ་འདིས་བསྟན་ནས་ཁྱེད་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་སྒོམ་ཞིང་བསླབ་པར་སེམས་བསྐྱེད་པ་ཡིན་ནོ།
en: Brahmarāja, it is just as you have said. The bodhisattva Cittaratnārcī has taught it, and you have developed the aspiration to meditate on and train in the patience that is because of the birthlessness of phenomena.”

source: །དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཚངས་པའི་འཁོར་མང་པོ་དང་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་གུས་པས་ཐལ་མོ་སྦྱར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་འདི་སྐད་དུ་ཤིན་ཏུ་དཀོན་ཞིང་ངོ་མཚར་ཆེའོ།
en: Then the great Brahmarāja, along with a great entourage of Brahmās, rose together from their seats, and with their robes over one shoulder and with palms together in veneration, they bowed down their heads to the bodhisattva Cittaratnārcī’s feet. They said, “This is very rare and marvelous!

source: །བདག་ཅག་ནི་དེང་སྐྱེས་བུ་ཆེན་པོ་འདི་དང་ཕྲད་པས་ཡང་དག་པའི་ཆོས་ཐོས་པར་གྱུར་ཏོ། །ཞེས་སྨྲས་སོ།
en: On this day we have met this great being and have heard the true Dharma.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོ་འདི་ནི་མ་འོངས་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་འབར་བ་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏོ།
en: Then the Bhagavat said to Brahmarāja, “In the future, this Cittaratnārcī will become a tathāgata, an arhat, a samyaksaṃbuddha, one with wisdom and virtuous conduct, a sugata, a knower of the world, an unsurpassable being, a guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, by the name of Essence of the Glorious Blazing Jewel.”

source: །ལེའུ་འདི་བསྟན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་སུམ་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཐོབ་པར་གྱུར་ཏོ།
en: When this chapter was taught, three hundred million bodhisattvas attained irreversibility from the highest, most complete enlightenment.

source: །ལྷའི་བུ་འབུམ་ཕྲག་བརྒྱད་སྟོང་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། མི་ཕལ་པ་ཚད་མེད་གྲངས་མེད་པ་སྙེད་ནི་རྡུལ་སྤངས་ཤིང་དྲི་མ་དང་བྲལ་ནས་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Eight hundred million devas and countless, innumerable kings, ministers, and ordinary people became free of dust and attained pure, stainless Dharma eyes.

source: །དེ་ནས་དེའི་ཚེ་འཁོར་མང་པོ་དེའི་ནང་ནས་དགེ་སློང་འབུམ་ཕྲག་ལྔ་བཅུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལས་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཕྱིར་མི་ལྡོག་པ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་བཞིན་རིན་ཆེན་འོད་འཕྲོས་ཆོས་བསྟན་པ་ཐོས་པས་ཐམས་ཅད་ཤིན་ཏུ་བརྟན་པར་གྱུར་ནས་བསམ་གྱིས་མི་ཁྱབ་པའི་སྨོན་ལམ་མཆོག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བས་ཡང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: At that time, in that vast assembly, five million bhikṣus, who were irreversible from the practice of bodhisattva conduct and from the aspiration to enlightenment and had heard the Dharma teaching of the bodhisattva Cittaratnārcī, all became stable and perfected supreme, inconceivable prayers.

source: སོ་སོ་ནས་རང་གི་གོས་ཕུད་དེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱས་ནས་མཆོག་ཏུ་བརྩོན་པའི་སེམས་བླ་ན་མེད་པ་བསྐྱེད་དེ།
en: They developed the aspiration for enlightenment, and each one took off their robes and offered them to the bodhisattva and developed the aspiration of supreme diligence.

source: སྨོན་ལམ་འདི་སྐད་དུ་བདག་ཅག་བསོད་ནམས་ཀྱི་དགེ་བའི་རྩ་བ་ཅི་བསགས་པ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡོངས་སུ་བསྔོའོ།
en: They made this prayer: “We dedicate all the good roots we have accumulated to irreversibility from the highest, most complete enlightenment.” “

source: །ཞེས་སྨོན་ལམ་བཏབ་བོ། །ཚངས་པའི་རྒྱལ་པོ་དགེ་སློང་མང་པོ་འདི་དག་ནི་བསོད་ནམས་འདི་ལ་བརྟེན་ནས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མངོན་པར་བསྒྲུབས་པས་བསྐལ་པ་ཆེན་པོ་དགུ་བཅུ་འདས་ནས་ཁོང་དུ་ཆུད་ཅིང་གོ་བར་འགྱུར་བས་འཁོར་བ་ལས་ངེས་པར་འབྱང་བར་འགྱུར་རོ།
en: Brahmarāja, through that merit, this multitude of bhikṣus will practice exactly what they have been taught, and after ninety great eons have passed, they will comprehend and understand it so that they will truly emerge from saṃsāra.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་མང་པོ་དེ་དག་ལ་ཁྱེད་བསྐལ་པ་གྲངས་མེད་པ་སུམ་ཅུ་འདས་ནས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། བསྐལ་པའི་མིང་ནི་རྒྱལ་བར་དཀའ་བའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །ཞིང་གི་མིང་ནི་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་སྟེ།
en: The Bhagavat then prophesied to that multitude of bhikṣus, “Bhikṣus, after thirty asaṃkhyeya eons have passed, you will all attain complete buddhahood during an eon by the name of Durjayaprabharāja in a realm by the name of Vimalaprabhā.

source: དུས་གཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བས་ཐམས་ཅད་མིང་མཐུན་པར་སྨོན་ལམ་གྱི་བཀོད་པས་བརྒྱན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་ཞིང་མཚན་རྣམ་པ་བཅུ་དང་ལྡན་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ།
en: You will all attain the highest, most complete enlightenment of buddhahood simultaneously, and you will all have the same name—Praṇidhāna­vyūhālaṃkāra­rāja—and you will possess ten features. “

source: །ཚངས་པའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་ཤིན་ཏུ་གྱ་ནོམ་པའི་མདོ་སྡེ་འདི་གང་གིས་ཡང་དག་པར་མཉན་ནས་ཡོངས་སུ་འཛིན་པར་བྱེད་ན་གཟི་བྱིན་ཆེན་པོའི་སྟོབས་དང་ལྡན་པར་འགྱུར་བས་གང་ལ་ལ་ཞིག་གིས་བསྐལ་པ་ཆེན་པོ་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཐབས་དང་མི་ལྡན་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་སྤྱད་པ་ལས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་གསེར་འོད་དམ་པའི་མདོ་སྡེ་འདི་ཡི་གེར་བྲིས་ནས་ཟླ་བ་ཕྱེད་ཕྱེད་ཅིང་སེམས་རྩེ་གཅིག་ཏུ་ཀློག་གམ།
en: Brahmarāja, whoever listens to and possesses this extremely wonderful sūtra—The Sublime Golden Light—will possess majestic power. “If someone without method practices the six perfections for many hundreds of thousands of great eons, and a noble man or noble woman writes out this Sūtra of the Sublime Golden Light and every half-month one-pointedly reads it or chants it, then the previous accumulation of merit would not be even a hundredth of this accumulation of merit.

source: ཁ་ཏོན་དུ་འདོན་པར་བྱེད་ན་འདིའི་བསོད་ནམས་གང་ཡིན་པ་དེ་སྔ་མའི་བསོད་ནམས་དང་བསྐྲུན་ན་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་བགྲང་བ་དང་དཔེ་དང་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: It would not come close to being any number, analogy, or cause of it. “

source: །ཚངས་པའི་རྒྱལ་པོ་དེའི་ཕྱིར་ངས་དེང་ཁྱོད་ཀྱིས་བསླབ་པར་བྱ་ཞིང་དྲན་པ་ཡོངས་སུ་བཟུང་ནས་གཞན་དག་ལ་རྒྱ་ཆེར་བསྟན་པར་བྱའོ་ཞེས་བསྟན་པ་ཡིན་ནོ།
en: Therefore, Brahmarāja, today I will give you instruction. I teach that you should maintain mindfulness and teach it widely to others. “

source: ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་སྤྱད་པ་ན་ཇི་ལྟར་དཔའ་བོ་གཡུལ་ངོར་འཇུག་པ་བཞིན་དུ་ལུས་དང་སྲོག་ལ་ཕངས་པ་མེད་པར་འདི་ལྟར་མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་དམ་པ་འདི་ཡོངས་སུ་སྤེལ་ཞིང་ཡང་དག་པར་བཟུང་བཀླགས་ཁ་ཏོན་དུ་བཏོན་ནས་གཞན་དག་ལ་ཡང་དག་པར་བསྟན་ཏེ་ཚངས་པའི་རྒྱལ་པོ་འདི་ལྟ་སྟེ་དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གལ་ཏེ་འཇིག་རྟེན་ན་འདུག་པར་གྱུར་ན་རིན་པོ་ཆེ་སྣ་བདུན་ཡང་ནུབ་པར་མི་འགྱུར་ལ།
en: In the past, when I was practicing the path of a bodhisattva, just as a warrior entering battle dedicates life and body to it, in the same way I promulgated, kept, read, recited, and correctly taught others this sublime, supreme king of sūtras. “

source: གལ་ཏེ་རྒྱལ་པོ་ཚེ་ཟད་པར་གྱུར་ན་རིན་པོ་ཆེ་སྣ་བདུན་ཡོད་པ་དག་ཀྱང་དེ་ཉིད་དུ་ནུབ་ཅིང་ཟད་པར་འགྱུར་རོ། །ཚངས་པའི་རྒྱལ་པོ་དེ་བཞིན་དུ་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་གལ་ཏེ་འཇིག་རྟེན་ན་གནས་པར་གྱུར་ན་ནི་བླ་ན་མེད་པའི་ཆོས་ཀྱི་རིན་པོ་ཆེ་རྣམས་ཀྱང་ནུབ་པར་མི་འགྱུར་ལ།
en: Brahmarāja, when a cakravartin is in the world, his seven jewels do not cease to exist, but if the king’s life comes to end, the seven jewels will vanish and cease. “Brahmarāja, in that same way, when this Supremely Victorious King of Sūtras, the Sublime Golden Light is in the world, the unsurpassable, precious Dharma will not cease.

source: གལ་ཏེ་མདོ་སྡེ་འདི་མེད་པར་གྱུར་ན་ནི་གནས་དེ་ཉིད་དུ་ནུབ་པར་འགྱུར་རོ།
en: If this sūtra ceases to exist, then the Dharma will cease in that region.

source: །དེ་ལྟ་བས་ན་མདོ་སྡེའི་རྒྱལ་པོ་འདི་སེམས་རྩེ་གཅིག་ཏུ་མཉན་ནས་ཡོངས་སུ་གཟུང་བར་བྱ། བཀླག་པར་བྱ། ཁ་ཏོན་དུ་གདོན་པར་བྱ། གཞན་དག་ལ་བསྟན་པར་བྱ་ཞིང་ཡི་གེར་འདྲི་བར་བསྐུལ་ནས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་དེ།
en: Therefore, one should, with a one-pointed mind, listen to, obtain, read, and recite this king of sūtras and teach it to others and encourage them to write it out while practicing the perfection of diligence—being completely diligent without concern for life or body.

source: ལུས་དང་སྲོག་ལ་ཡང་ཕངས་པ་མེད་པར་རབ་ཏུ་བརྩོན་པར་བྱེད་ན་བསོད་ནམས་ཀྱི་ནང་ན་མཆོག་ཏུ་འགྱུར་བས་ངའི་སློབ་མ་རྣམས་ཀྱིས་དེ་བཞིན་དུ་རབ་ཏུ་བརྩོན་པས་རྣལ་འབྱོར་བསྒོམ་པར་བསླབ་པར་བྱའོ། །དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཚངས་པའི་འཁོར་ཚད་མེད་པ་སྙེད་དང་། བརྒྱ་བྱིན་དང་།
en: This is supreme among all merits, and therefore my pupils similarly should diligently train in meditation on its practice.”

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་རྣམས་དང་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བའི་མདོ་སྡེ་འདི་དང་། ཆོས་འཆད་པའི་མཁན་པོ་གང་ལགས་པ་དེ་དག་ཡོངས་སུ་བསྲུང་ཞིང་སྤེལ་བར་བགྱིད་ལ། གལ་ཏེ་བགེགས་བགྱིད་པ་ཞིག་མཆིས་ན་ཡང་བདག་ཅག་གིས་ཡོངས་སུ་བསལ་ནས་དགེ་བ་མང་པོ་དང་ལྡན་པ་དང་།
en: Then the great Brahmarāja, the innumerable Brahmā entourage, Śakra, the Four Mahārājas, and the yakṣas rose from their seats and, with their robes over one shoulder, kneeling on their right knees, and with palms together in veneration, said to the Bhagavat, “Bhagavat, we will protect and spread this Supremely Victorious King of Sūtras, the Sublime Golden Light and protect anyone who teaches it.

source: ཁ་དོག་དང་། མཐུ་སྟོབས་དང་ལྡན་པ་དང་། སྤོབས་པ་ལ་ཐོགས་པ་མ་མཆིས་པ་དང་། ལུས་དང་སེམས་བག་ཡངས་སུ་འགྱུར་བ་དང་། ཉན་པའི་འཁོར་རྣམས་བདེ་བ་མྱོང་བར་བགྱིད་དོ།
en: If there is an obstacle, we will eliminate it and cause those teachers to have many virtues, have good color and strength and unimpeded eloquence, make their bodies and minds carefree, and also make their audiences experience happiness.

source: །ཡུལ་གང་ན་གནས་པ་དེར་མུ་གེ་དང་། ཕྱིར་རྒོལ་བའི་དགྲ་དང་། མི་མ་ལགས་པ་དག་གིས་འཚེ་ཞིང་གནོད་པ་བགྱིད་པར་གྱུར་ན། བདག་ཅག་ལྷའི་འཁོར་རྣམས་ཀྱིས་ཡོངས་སུ་བསྲུངས་ནས་སྐྱེ་བོ་རྣམས་བདེ་སྐྱིད་ཅིང་ལོངས་སྤྱོད་རྒྱས་པ་དང་། གློ་བུར་གྱི་གནོད་པ་རྣམས་མ་མཆིས་པར་བགྱིད་དེ།
en: If there is famine, adverse enemies, or harm from nonhumans in the land where they dwell, we and our entourages of devas will protect them and increase the enjoyment of happiness for the people and prevent there being any sudden harm.

source: འདི་དག་ཐམས་ཅད་ཀྱང་བདག་ཅག་དང་ལྷའི་འཁོར་རྣམས་ཀྱི་མཐུ་ལགས་སོ།
en: That is the power that we and our entourages of devas have.

source: །གང་ལ་ལ་ཞིག་གིས་མདོ་སྡེ་འདི་ལ་མཆོད་པ་བགྱིས་ན་བདག་ཅག་ཀྱང་སངས་རྒྱས་ཇི་ལྟ་བ་བཞིན་དུ་ཐ་དད་པ་མ་མཆིས་པའི་བསམ་པས་བཀུར་སྟི་དང་མཆོད་པ་བགྱིད་དོ།
en: If anyone makes an offering to this sūtra, we will honor them and make offerings to them, considering them to be no different from the Buddha.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་དང་། ཚངས་པའི་འཁོར་རྣམས་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་ལ་སོགས་པའི་བར་དག་ལ་བཀའ་སྩལ་པ་ལེགས་སོ་ལེགས་སོ།
en: Then the Bhagavat said to great Brahmarāja, the Brahmā entourage, and so on, until the Four Mahārājas, the yakṣas, and so on, “Excellent, excellent!

source: །ཁྱེད་ཀྱིས་ཆོས་ཟབ་མོ་གྱ་ནོམ་པ་ཐོས་ནས་མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་དམ་པ་འདི་དང་མདོ་སྡེ་འཛིན་པ་དག་ལ་ཡོངས་སུ་བསྲུངས་ཤིང་ཡོངས་སུ་བསྐྱབས་པས་བསོད་ནམས་ཁྱད་པར་དུ་འཕགས་པ་མཐའ་མེད་པ་སྙེད་ཐོབ་ནས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: You have heard the wonderful, profound Dharma, and through guarding and protecting this sublime, supreme king of sūtras and those who hold the sūtra, you will attain endless superior merit, and you will quickly attain the highest, most complete enlightenment of perfect buddhahood.”

source: །དེ་ནས་དེའི་ཚེ་ཚངས་པའི་རྒྱལ་པོ་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ཐོས་ནས་རབ་ཏུ་དགའ་སྟེ་སྤྱི་བོས་བླངས་པར་གྱུར་ཏོ།
en: Then Brahmarāja and the others, having heard what the Bhagavat said, were overjoyed and placed it above their heads.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་སྟོང་པ་ཉིད་ལ་བརྟེན་ནས་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།དེ་ནས་ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། ལྷའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་དང་། ལྷའི་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ་དང་། ལྷའི་རྒྱལ་པོ་མིག་མི་བཟང་ཅིག་ཆར་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རྟག་པར་དགོངས་ཤིང་གཟིགས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་བགྱིས་པ། ལྷ་དང་ཀླུ་ཐམས་ཅད་ཀྱིས་རྟག་པར་མཆོད་པ། ལྷའི་འཁོར་རྣམས་ཀྱིས་རྟག་པར་དགའ་བ་སྐྱེད་པ། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་རྟག་པར་བསྔགས་པ་བརྗོད་པ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ། ལྷའི་གཞལ་མེད་ཁང་ཐམས་ཅད་གསལ་བར་བགྱིད་པ།
en: This concludes “The Fulfillment of Prayers on the Basis of Emptiness,” the tenth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཁྱད་པར་དུ་འཕགས་པའི་བདེ་བ་སྩོལ་བ། སེམས་ཅན་དམྱལ་བ་དང་། ཡི་དགས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་འགྲོ་བ་རྣམས་ཀྱི་སྡུག་བསྔལ་ཉེ་བར་ཞི་བར་བགྱིད་པ། འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་རབ་ཏུ་སེལ་བ། ཕས་ཀྱི་དགྲ་ཐམས་ཅད་ཕྱིར་ཟློག་པར་བགྱིད་པ། མུ་གེའི་དུས་ངན་པའི་ཚེ་ལོ་ལེགས་པར་བགྱིད་པ།
en: Chapter 11: The Four Mahārājas Look Upon Devas and Humans Then the deva king Vaiśravaṇa, the deva king Dhṛtarāṣṭra, the deva king Virūḍhaka, and the deva king Virūpākṣa rose from their seats, and with their upper robes over one shoulder, knelt on their right knees and, facing the Bhagavat with palms together, bowed their heads to the Bhagavat’s feet and said to the Bhagavat, “Bhagavat, this Supremely Victorious King of Sūtras, the Sublime Golden Light is constantly regarded and seen by all buddhas; it is honored by all bodhisattvas; it is paid homage to by all the hosts of devas; it is constantly offered to by all devas and asuras; it is constantly rejoiced in by all the hosts of devas; it is constantly praised by all the protectors of the world; it is possessed by the śrāvakas and pratyekabuddhas; it illuminates all the divine palaces of the devas; it bestows a superior happiness upon all beings; it ends the suffering of beings who are in the hells, are pretas, and are animals; it dispels all fear and terror; it repels all hostile enemies; it creates excellent harvests during the bad times of famine; it ends all the suffering from diseases; and it ends all bad omens and hundreds of thousands of harms from suffering. “

source: རིམས་ནད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་བགྱིད་པ། ལྟས་ངན་པ་ཐམས་ཅད་དང་། སྡུག་བསྔལ་གྱི་གནོད་པ་བརྒྱ་སྟོང་རབ་ཏུ་ཞི་བར་བགྱིད་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ནི་འདི་ལྟ་བུའི་བདེ་བ་སྩོལ་ཅིང་བདག་ཅག་ལ་ཡང་སྨན་པར་བགྱིད་པ་ལགས་ན།
en: Bhagavat, this Supremely Victorious King of Sūtras, the Sublime Golden Light bestows happiness and is also beneficial for us.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོའི་ནང་དུ་རྒྱ་ཆེར་བཀས་བཤད་དུ་གསོལ།
en: Therefore, Bhagavat, we pray that you will teach it through an extensive instruction within this vast assembly.

source: བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་འཁོར་དང་བཅས་པས་བླ་ན་མ་མཆིས་པའི་བདུད་རྩིའི་ཆོས་ཀྱི་རོ་འདི་ཐོས་པར་གྱུར་ན་མཐུ་སྟོབས་དང་ལྡན་ཞིང་གཟི་བྱིན་འཕེལ་བ་དང་། བརྩོན་འགྲུས་དང་ལྡན་ཞིང་དཔའ་བར་འགྱུར་བ་དང་། རྫུ་འཕྲུལ་ཡང་ཆེས་ལྷག་ཅིང་ཁྱད་པར་དུ་འཕགས་པར་འགྱུར་ལགས་སོ།
en: If we Four Mahārājas and our retinues can obtain the flavor of this Dharma of unsurpassable amṛta, our power and magnificence will increase, we will become diligent and heroic, and our miraculous powers will greatly increase and be superior. “

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་བཞི་ཡང་ཆོས་ཡང་དག་པ་མངོན་པར་སྒྲུབ་ཅིང་རྟག་པར་ཡང་དག་པའི་ཆོས་བསྟན་ནས་ཆོས་ཀྱིས་འཇིག་རྟེན་འདུལ་བར་བགྱིད་པས་བདག་ཅག་གིས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: Bhagavat, we Four Mahārājas practice the Dharma correctly and always teach the true Dharma and guide the Dharma kingdoms.

source: གྲུལ་བུམ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་དང་། མིའི་རྒྱལ་པོ་རྣམས་ཀྱང་རྟག་པར་ཡང་དག་པའི་ཆོས་ཀྱིས་འཇིག་རྟེན་འདུལ་བ་ལ་དགོད་པར་བགྱིད་པས་སྡིག་པ་རྣམས་འགོག་ཅིང་ཡོངས་སུ་སེལ་བར་བགྱིད་དོ། །མིའི་མདངས་འཕྲོག་པར་བགྱིད་པའི་འདྲེ་སྲིན་བྱམས་པ་དང་སྙིང་རྗེ་མ་མཆིས་པ་ཅི་མཆིས་པ་ཐམས་ཅད་ཀྱང་ཐག་རིང་དུ་མཆི་བར་འགྱུར་ལགས་སོ།
en: Therefore, we constantly establish devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kumbhāṇḍas, kinnaras, mahoragas, and human kings to guide Dharma kingdoms through the true Dharma, so that bad actions are stopped and eliminated, and all demons who have no love or compassion and steal the vitality of others will stay far away. “

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་བཞི་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཚད་མ་མཆིས་པ་སྙེད་དང་བཅས་པས་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་ཡང་དག་པར་འདས་པས་འཛམ་བུའི་གླིང་འདིར་ལྟ་བར་བགྱིད་ཅིང་ཡོངས་སུ་བསྐྱབ་པ་དང་ཡོངས་སུ་བསྲུང་བར་བགྱིད་དེ།
en: Bhagavat, we Four Mahārājas and the twenty-eight great generals of the yakṣas, along with many hundreds of thousands of yakṣas, continually look at this Jambudvīpa with our pure divine vision, which transcends that of humans, and we defend it and protect it. “

source: བཅོམ་ལྡན་འདས་རྒྱུ་དང་རྐྱེན་དེས་ན་བདག་ཅག་རྒྱལ་པོ་རྣམས་ཀྱང་འཇིག་རྟེན་སྐྱོང་བ་ཞེས་བགྱི་བ་ལགས་སོ། །གཞན་ཡང་འཛམ་བུའི་གླིང་འདིར་ཡུལ་གྱི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་ལ་ཕས་ཀྱི་རྒོལ་བའི་དགྲ་རྣམས་རྟག་པར་ཉེ་བར་མཆིས་ཏེ་གནོད་པ་བགྱིས་པར་གྱུར་ཏམ།
en: Bhagavat, for that reason and condition, we kings are called world protectors. “
